ci4/app/Controllers/Auth.php

    public function doLogin()
    {
        $model = new UserModel();
        $user = $model->where('username', $this->request->getPost('username'))->first();
---
SELECT *
FROM `users`
WHERE `username` = 'viona'
 LIMIT 1