ci4/app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        parent::initController($request, $response, $logger);

        $allowedRoutes = [
            '/login',
            '/auth/login',
            '/auth/dologin',
        ];

        $currentPath = $this->request->getUri()->getPath();

        if (!session()->get('logged_in') && !in_array($currentPath, $allowedRoutes)) {
            return redirect()->to('/login')->send();
        }

        // Penambahan: ambil data alert dan message dari database
        $alertModel = new AlertModel();
        $messageModel = new MessageModel();

        $alerts = $alertModel->where('status', 'unread')->orderBy('created_at', 'DESC')->findAll(5);
        $messages = $messageModel->orderBy('created_at', 'DESC')->findAll(5);
---
SELECT *
FROM `alerts`
WHERE `status` = 'unread'
ORDER BY `created_at` DESC
 LIMIT 5
SELECT *
FROM `messages`
ORDER BY `created_at` DESC
 LIMIT 5