ci4/app/Controllers/Home.php

SELECT SUM(jumlah) as total
FROM `iuran`
WHERE `tahun` = '2025'
 LIMIT 1
SELECT `bulan`, SUM(jumlah) as total
FROM `iuran`
GROUP BY `bulan`
SELECT COUNT(*) AS `numrows` FROM `warga`
SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT *
FROM `iuran`
WHERE `bulan` = 'July'
) CI_count_all_results
---
    public function dashboard()
    {
        $iuranModel = new IuranModel();
        $wargaModel = new WargaModel();
        $permohonanModel = new PermohonanModel();

        // 1. Total kas tahunan (tahun berjalan)
        $kasTahunan = $iuranModel
            ->select('SUM(jumlah) as total')
            ->where('tahun', date('Y'))
            ->first();

        // 2. Kas bulanan (per bulan)
        $kasBulanan = $iuranModel
            ->select('bulan, SUM(jumlah) as total')
            ->groupBy('bulan')
            ->findAll();

        // 3. Warga tertunggak bulan ini (belum bayar)
        $bulanIni = date('F'); // Contoh: "May"
        $totalWarga = $wargaModel->countAll();
        $sudahBayar = $iuranModel->where('bulan', $bulanIni)->distinct()->countAllResults('warga_id');