ci4/app/Controllers/Laporan.php

SELECT `tahun`, `bulan`, SUM(jumlah) as total, COUNT(DISTINCT iuran.warga_id) as jumlah_warga
FROM `iuran`
LEFT JOIN `warga` ON `warga`.`id` = `iuran`.`warga_id`
WHERE `bulan` = 'Januari'
AND `tahun` = '2025'
GROUP BY `tahun`, `bulan`
---
    public function pdf()
    {
        $bulan = $this->request->getGet('bulan');
        $tahun = $this->request->getGet('tahun');

        if (empty($bulan) || empty($tahun)) {
            return redirect()->to('/error');
        }

        $validBulan = ['Januari', 'Februari', 'Maret', 'April', 'Mei', 'Juni', 'Juli', 'Agustus', 'September', 'Oktober', 'November', 'Desember'];
        if (!in_array($bulan, $validBulan) || !is_numeric($tahun)) {
            return redirect()->to('/error');
        }


        $query = (new IuranModel())
            ->select('tahun, bulan, SUM(jumlah) as total, COUNT(DISTINCT iuran.warga_id) as jumlah_warga')
            ->join('warga', 'warga.id = iuran.warga_id', 'left')
            ->groupBy(['tahun', 'bulan']);

        if ($bulan) {
            $query->where('bulan', $bulan);
        }

        if ($tahun) {
            $query->where('tahun', $tahun);
        }

        $data['laporan'] = $query->findAll();